Hitters Dataset
------------------
Find out no of missing values in each column

Find of people who have batted for more than 400 matches

Find out the name of the player who has hit max home runs

Find out league wise total number of players

Find out division wise total amount of salary invested

Find out five most senior players.

# Read dataset

In [1]:
import pandas as pd
A = pd.read_csv("C:/Users/I A T Laptop L.L.C/Desktop/JupyterN/hitters.csv")

In [2]:
A.head()

,Name,AtBat,Hits,HmRun,Runs,RBI,Walks,Years,CAtBat,CHits,...,CRuns,CRBI,CWalks,League,Division,PutOuts,Assists,Errors,Salary,NewLeague
0,Andy Allanson,293,66,1,30,29,14,1,293,66,...,30,29,14,A,E,446,33,20,NaN,A
1,Alan Ashby,315,81,7,24,38,39,14,3449,835,...,321,414,375,N,W,632,43,10,475.0,N
2,Alvin Davis,479,130,18,66,72,76,3,1624,457,...,224,266,263,A,W,880,82,14,480.0,A
3,Andre Dawson,496,141,20,65,78,37,11,5628,1575,...,828,838,354,N,E,200,11,3,500.0,N
4,Andres Galarraga,321,87,10,39,42,30,2,396,101,...,48,46,33,N,E,805,40,4,91.5,N

# Find out no of missing values in each column

In [3]:
A.isna().sum()

Name          0
AtBat         0
Hits          0
HmRun         0
Runs          0
RBI           0
Walks         0
Years         0
CAtBat        0
CHits         0
CHmRun        0
CRuns         0
CRBI          0
CWalks        0
League        0
Division      0
PutOuts       0
Assists       0
Errors        0
Salary       59
NewLeague     0
dtype: int64

Missing values are only in "salary" column-322-263=59

# Find out the name of the player who has hit max home runs

In [4]:
x = A.HmRun.max()
A[A.HmRun == x][["Name"]]

               Name
136  Jesse Barfield

#  Find out league wise total number of players

In [5]:
A.groupby(by=["League"]).Walks.count()

League
A    175
N    147
Name: Walks, dtype: int64

# Find out division wise total amount of salary invested

In [6]:
A.groupby(by=["Division"]).Salary.sum()

Division
E    80531.006
W    60417.501
Name: Salary, dtype: float64

# Find out five most senior players.

In [7]:
A.sort_values(by=["Years"]).tail(5)[["Name","Years"]]

               Name  Years
306     Ted Simmons     19
121   Graig Nettles     20
249  Reggie Jackson     20
302      Tony Perez     23
236       Pete Rose     24

# Find of people who have batted for more than 400 matches

In [8]:
A[A.AtBat > 400][["Name","AtBat"]]

                Name  AtBat
2        Alvin Davis    479
3       Andre Dawson    496
5    Alfredo Griffin    594
9     Andre Thornton    401
10     Alan Trammell    574
..               ...    ...
317     Willie McGee    497
318  Willie Randolph    492
319   Wayne Tolleson    475
320    Willie Upshaw    573
321    Willie Wilson    631

[151 rows x 2 columns]